Revit 2024 API
DisciplineTypeId Class
 This class contains constants identifying disciplines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static class DisciplineTypeId
Visual Basic
Public NotInheritable Class DisciplineTypeId
Visual C++
public ref class DisciplineTypeId abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DisciplineTypeId
See Also
DisciplineTypeId Members
Autodesk.Revit.DB Namespace